*****1. Порождающие шаблоны проектирования (Creational):
1.1. Абстрактная фабрика (Abstract Factory) - 
	ОРМ(Об'єктно-реляційне відображення), яке буде підтримувати різноманітні СУБД - MySQL, Oracle...
	Інтерфейс фабрики, яка буде створювати усі необхідні компоненти системи:
	- з'єднання з БД
	- запис таблиці БД
	- конструктор запитів до БД
	-...
	Написати фабрики, що реалізують даний інтерфейс,
	кожна фабрика повертає об'єкт відповідний СУБД.
1.2. Строитель (Builder) - 
	Отделяет конструирование сложного объекта от его представления, так что в результате одного и того же процесса конструирования могут получаться разные представления.
	-Когда в программе для чтения текста в формате RTF добавляется функционал его преобразования в форматы ASCII и TeX.
1.3. Фабричный Метод (Factory Method) - 

1.4. Пул одиночек (Multiton)
1.5. Объектный пул (Pool)
1.6. Прототип (Prototype)
1.7. Простая Фабрика (Simple Factory)
1.8. Одиночка (Singleton) - 
	З'єднання з БД, якщо з'єднання з БД існує, то просто поверне об'єкт уже існуючого з'єднання
1.9. Статическая Фабрика (Static Factory)